#include <iostream>

/*Задание 1. Запасы продовольствия
Что нужно сделать
Ваш космический корабль потерпел крушение на пустынной планете. Еда здесь не растёт,
но вы спасли из - под обломков 100 - килограммовый мешок гречки. Из прошлого опыта вы знаете,
что если будете экономно питаться, то у вас будет уходить по четыре килограмма гречки в месяц.
Чтобы прикинуть гречневый бюджет, вы решили написать программу, которая выведет информацию о том,
сколько килограммов гречки у вас должно быть в запасе через месяц, два и так далее, пока она не закончится.
Пример выполнения
Всего гречки было на начало подсчёта : 100 кг
После 1 месяца у вас в запасе останется 96 кг гречки
После 2 месяца у вас в запасе останется 92 кг гречки
…
После _ месяца гречка закончится
Рекомендации по выполнению
Для решения данной задачи рекомендуется использовать цикл for.
Что оценивается
• Программа выводит информацию об остатке гречки за каждый месяц с помощью циклов.
• Текстовое сообщение выводится в цикле и за каждый месяц.
• Программа заканчивает выполнение только после того, как в мешке не осталось гречки.
*/

void pW1() {
	std::cout << "We started with 100 kg buckwheat\n";
	for (int i = 1, j = 96; j >= 0; ++i, j -= 4) {
		std::cout << "After " << i << "mounth you have " << j << "kg buckwheat\n";
	}
}

/*
Задание 2. Кофемашина
Что нужно сделать
Инженеры компании «Спейс Инжиниринг» не могут продуктивно работать без кофе.
Недавно в их кофемашину случайно попал космический луч и повредил программу - прошивку.Вас умоляют помочь.
Кофемашина умеет готовить два напитка : американо и латте.
Для американо требуется 300 мл воды, а для латте 30 мл воды и 270 мл молока.
Напишите программу, которая спрашивает у пользователя(это действие программа делает один раз в начале работы),
сколько всего миллилитров молока и воды залито в кофемашину, после чего начинает обслуживание,
спрашивая, какой напиток хочет очередной посетитель.Пользователь выбирает один из двух напитков,
программа отвечает одним из трёх вариантов : «Ваш напиток готов», «Не хватает воды» или «Не хватает молока»,
после чего переходит к обслуживанию следующего посетителя.Если молока и воды не хватает ни на один вид напитка,
программа выдаёт отчёт и завершается.В отчёте должно быть написано, что ингредиенты подошли к концу,
должен быть указан остаток воды и молока в машине, а также должно быть указано, сколько всего было
приготовлено чашек американо и латте за эту смену.Выберите наиболее удобный для написания программы цикл.
Обеспечьте контроль ввода.
Пример выполнения
Введите количество воды в мл : 30
Введите количество молока в мл : 270
Выберите напиток(1 — американо, 2 — латте) : 2
Ваш напиток готов.
* **Отчёт * **
Ингредиентов осталось :
Вода: 0 мл
Молоко : 0 мл
Кружек американо приготовлено : 0
Кружек латте приготовлено : 1
Рекомендации по выполнению
• Перед тем как останавливать работу кофемашины, нужно убедиться, что ни один из напитков нельзя приготовить.
• Количество напитков разных видов следует считать отдельно.
• Для решения программы рекомендуется использовать цикл while.
Что оценивается
• Правильно определяется количество оставшихся ингредиентов.
• Количество ингредиентов не становится отрицательным.
• Программа не выводит отчёт, если количества ингредиентов хватает хотя бы на один из напитков.
• Если ингредиентов не хватает для приготовления любого из напитков, программа должна вывести отчёт. */

void pW2() {
	int americanoCount = 0;
	int latteCount = 0;
	int water;
	int milk;
	std::cout << "Enter the amount of water in ml: ";
	std::cin >> water;
	std::cout << "Enter the amount of milk in ml: ";
	std::cin >> milk;
	while (water >= 30 && milk >= 270 || water >= 300) {
		int drink;
		std::cout << "Choose the drink (1 - americano, 2 - latte): ";
		std::cin >> drink;
		if (drink == 1) {
			if (water >= 300) {
				water -= 300;
				std::cout << "Your drink has been prepared\n";
				americanoCount++;
			}
			else std::cout << "There is't enough water: \n";
		}
		else if (drink == 2) {
			if (milk >= 270) {
				milk -= 270;
				water -= 30;
				std::cout << "Your drink has been prepared\n";
				latteCount++;
			}
			else std::cout << "There is't enough milk: \n";
		}
		else std::cout << "Your chose is impossible\n";
	}
	std::cout << "***Report***\n";
	std::cout << "Ingredients left\n";
	std::cout << "Water: " << water << " ml" << "\n";
	std::cout << "Milk: " << milk << " ml" << "\n";
	std::cout << "Caps of Americano made: " << americanoCount << "\n";
	std::cout << "Caps of Latte made: " << latteCount << "\n";
}

/*
Задание 3. Красный Марс
Что нужно сделать
В «Спейс Инжиниринг» были впечатлены тем, как вы справились с кофемашиной и решили отдать
вам на аутсорс разработку программы для нового робота-разведчика поверхности Марса.
Это первый прототип, поэтому он тестируется в прямоугольном помещении размером 15 на 20 метров.
Марсоход высаживается в центре комнаты, после чего управление им передаётся оператору — пользователю
вашей программы. Программа спрашивает, в какую сторону оператор хочет направить робота:
север (клавиша W), юг (клавиша S), запад (клавиша A) или восток (клавиша D).
Оператор делает выбор, марсоход перемещается на 1 метр в эту сторону и программа сообщает новую
позицию марсохода. Если марсоход упёрся в стену, то он не должен пытаться перемещаться в сторону стены,
в этом случае его позиция не меняется.
Пример выполнения
[Программа]: Марсоход находится на позиции 6, 19, введите команду:
[Оператор]: A
[Программа]: Марсоход находится на позиции 5, 19, введите команду:
[Оператор]: W
[Программа]: Марсоход находится на позиции 5, 20, введите команду:
[Оператор]: W
[Программа]: Марсоход находится на позиции 5, 20, введите команду:
[Оператор]: S
[Программа]: Марсоход находится на позиции 5, 19, введите команду:
[Оператор]: S
[Программа]: Марсоход находится на позиции 5, 18, введите команду:
…
Рекомендации по выполнению
• Необходимо обеспечить контроль ввода пользователя и сообщать об ошибке в случае неправильного ввода.
• Помните об ограничениях комнаты при перемещении робота.
Что оценивается
• Использованы конструкции else и else if.
• Координаты марсохода не выходят за границы помещения.
• Программа не завершает работу если робот упёрся в стенку.
*/

void pW3() {
	int x = 7;
	int y = 10;
	std::string derection;
	std::cout << "Instruction:\n север(клавиша W), юг(клавиша S), запад(клавиша A) или восток(клавиша D)\n\n";
	while (true) {
		std::cout << "[Programme]: Mars rover is " << x << ", " << y << ", enter the command\n";
		std::cout << "[User]: ";
		std::cin >> derection;
		if (derection == "A" || derection == "a") {
			if (x > 0) x--;
		}
		else if (derection == "D" || derection == "d") {
			if (x < 15) x++;
		}
		else if (derection == "W" || derection == "w") {
			if (y < 20) y++;
		}
		else if (derection == "S" || derection == "s") {
			if (y > 0) y--;
		}
		else std::cout << "The value entered is incorrect\n";
	}
}

/*
Задание 4. Рамка
Что нужно сделать
Напишите программу, которая рисует с помощью символьной графики прямоугольную рамку.
Для вертикальных линий используйте символ вертикального штриха «|», а для горизонтальных — дефис «-».
Пусть пользователь вводит ширину и высоту рамки.
Пример выполнения
6 — ширина, 4 — высота:
Рекомендации по выполнению
Ширину и высоту удобно вводить с помощью одной операции std::cin:
int width, height;
std::cin >> width >> height;
Что оценивается
Рамка рисуется в соответствии с заданными размерами и с помощью условных конструкций и циклов.
*/

void pW4() {}

/*
Задание 5. Координатные оси
Что нужно сделать
Модифицируйте пример с координатными осями так, чтобы в точке их пересечения рисовался знак « + », на верхнем конце вертикальной оси была стрелка вверх «^ », а на правом конце горизонтальной оси — стрелка вправо « > ».Это сделает рисунок более красивым и точным.
Пример выполнения
Рекомендации по выполнению
Заметьте, что в центре координатных осей есть пересечение.
Что оценивается
Координатные оси рисуются с помощью условных конструкций и циклов.
*/

void pW5() {}

/*
Задание 6. Важные объявления
Что нужно сделать
Напишите программу для печати важных объявлений.Сверху объявления должен располагаться вот такой колонтитул :
Восклицательные знаки всегда располагаются по центру строки, причём в зависимости от важности объявления
количество восклицательных знаков может быть разным.Напишите программу, которая спрашивает у пользователя
сначала общую длину колонтитула в символах, потом желаемое количество восклицательных знаков,
после чего выводит на экран готовую строку.Обеспечьте контроль ввода.
Пример выполнения
Рекомендации по выполнению
Если невозможно разместить восклицательные знаки ровно по центру, допускается сдвиг на один символ.
Что оценивается
• Символов всегда ровно столько, сколько требует пользователь.
• Вывод восклицательных знаков находится посередине, когда это возможно, и со сдвигом на один символ
в остальных случаях.
*/

void pW6() {}

/*
Задание 7. Биолаборатория * (дополнительное задание)
Что нужно сделать
В борьбе со всемирной эпидемией коринебактерий исследователи компании «Терран Биотех» открыли новый антибиотик.
Напишите программу, помогающую протестировать его.
В чашку Петри исследователи кладут N бактерий и добавляют X капель антибиотика.
Известно, что число коринебактерий в чашке Петри увеличивается в два раза каждый час,
а каждая капля антибиотика в первый час убивает 10 бактерий, во второй час — 9 бактерий,
в следующий — 8 и так далее, пока антибиотик не перестанет действовать.
Заметьте, что сначала число коринебактерий увеличивается, а затем действует антибиотик.
Пользователь вашей программы вводит N и X, а программа печатает на экране,
сколько бактерий останется в чашке Петри в конце каждого часа, до тех пор, пока не закончатся
бактерии или антибиотик не перестанет действовать.Судьба человечества — в ваших руках.
Обеспечьте контроль ввода.
Пример выполнения
Введите количество бактерий : 12
Введите количество антибиотика : 1
После 1 часа бактерий осталось 14
После 2 часа бактерий осталось 19
После 3 часа бактерий осталось 30
После 4 часа бактерий осталось 53
…
Что оценивается
• Цикл не бесконечный.
• Количество бактерий и антибиотика не становится отрицательным.
• После того как количество антибиотики или бактерий становиться равным нулю выполнение программы
должно быть завершено.
*/

void pW7() {}

/*Задание 8. Ёлочка * (дополнительное задание)
Что нужно сделать
Напишите программу, которая выводит на экран равнобедренный треугольник, заполненный символами решётки «#».
Пусть высота треугольника вводится пользователем.Обеспечьте контроль ввода.
Пример выполнения
Рекомендации по выполнению
• Решение можно организовать с помощью двух циклов, один для вывода пробельных символов,
второй для вывода символа решётки.
Что оценивается
• Между строкой ввода и верхушкой ёлочки не должно быть пустых строк.
• Высота ёлочки соответствует значению, введённому с клавиатуры.
• Ёлочка рисуется с помощью циклов.
*/

void pW8() {}
